Lagunaxx/ESP32_SPIDisplay/ESP32-SPIDisplay.cpp
/***************************************************
 Arduino TFT graphics library targeted at ESP8266
 and ESP32 based boards.

 This is a standalone library that contains the
 hardware driver. Graphics functions and
 proportional fonts moved to separated classes.

 Created by Bodmer 2/12/16

 Modifyed by Laguna_x 16/oct/2019
 ****************************************************/

#include "ESP32-SPIDisplay.h"

namespace Device {
namespace Display {

//Screen* Driver;

/*******************************************************************************
 *                                                                             *
 * Usage:                                                                      *
 *                                                                             *
 *  #include <ESP32-SPIDisplay.h>                                              *
 *                                                                             *
 *  Device::Display::init();                                                   *
 *   //or                                                                      *
 *  Device::Display::init(width, height);                                      *
 *   // where width and height are type of T_DispCoords                        *
 *                                                                             *
 *  Next where have needs use Driver as pointer to Screen class                *
 *                                                                             *
 *  To remove driver from memory call                                          *
 *  Device::Display::remove();                                                 *
 *                                                                             *
 *******************************************************************************/
//Screen* Driver;
void init(T_DispCoords _W, T_DispCoords _H, uint8_t _R
#ifdef ST7735_DRIVER
		, uint8_t tc
#endif
		) {
	Driver = new Screen(_W, _H);
#ifdef ST7735_DRIVER
	Driver->init(tc);
#else
	Driver->init();
#endif
	Driver->setRotation(_R);
}
void init(uint8_t R
#ifdef ST7735_DRIVER
		, uint8_t tc
#endif
		) {
	init(TFT_WIDTH,
	TFT_HEIGHT, R
#ifdef ST7735_DRIVER
		, tc
#endif
			);
}
void init(
#ifdef ST7735_DRIVER
		, uint8_t tc
#endif
) {
	init(0
#ifdef ST7735_DRIVER
		, tc
#endif
			);
}
void remove() {
	delete (Driver);
}

void Screen::PrintError(const char message[]) {
	//use it for debugging spi. Make print to serial or whatever.
	;
}

/***************************************************************************************
 ** Function name:           Screen
 ** Description:             Constructor , we must use hardware SPI pins
 ***************************************************************************************/
Screen::Screen(T_DispCoords w, T_DispCoords h) // @suppress("Class members should be properly initialized")
		{

	// The control pins are deliberately set to the inactive state (CS high) as setup()
	// might call and initialise other SPI peripherals which would could cause conflicts
	// if CS is floating or undefined.
#ifdef TFT_CS
	digitalWrite(TFT_CS, HIGH); // Chip select high (inactive)
	pinMode(TFT_CS, OUTPUT);
#endif

	// Configure chip select for touchscreen controller if present
	/*		#ifdef TOUCH_CS
	 digitalWrite(TOUCH_CS, HIGH); // Chip select high (inactive)
	 pinMode(TOUCH_CS, OUTPUT);
	 #endif
	 */
#ifdef TFT_WR
		  digitalWrite(TFT_WR, HIGH); // Set write strobe high (inactive)
		  pinMode(TFT_WR, OUTPUT);
		#endif

#ifdef TFT_DC
	digitalWrite(TFT_DC, HIGH); // Data/Command high = data mode
	pinMode(TFT_DC, OUTPUT);
#endif

#ifdef TFT_RST
	if (TFT_RST >= 0) {
		digitalWrite(TFT_RST, HIGH); // Set high, do not share pin with another SPI device
		pinMode(TFT_RST, OUTPUT);
	}
#endif

#ifdef ESP32_PARALLEL

		  // Create a bit set lookup table for data bus - wastes 1kbyte of RAM but speeds things up dramatically
		  for (int32_t c = 0; c<256; c++)
		  {
			xset_mask[c] = 0;
			if ( c & 0x01 ) xset_mask[c] |= (1 << TFT_D0);
			if ( c & 0x02 ) xset_mask[c] |= (1 << TFT_D1);
			if ( c & 0x04 ) xset_mask[c] |= (1 << TFT_D2);
			if ( c & 0x08 ) xset_mask[c] |= (1 << TFT_D3);
			if ( c & 0x10 ) xset_mask[c] |= (1 << TFT_D4);
			if ( c & 0x20 ) xset_mask[c] |= (1 << TFT_D5);
			if ( c & 0x40 ) xset_mask[c] |= (1 << TFT_D6);
			if ( c & 0x80 ) xset_mask[c] |= (1 << TFT_D7);
		  }

		  // Make sure read is high before we set the bus to output
		  digitalWrite(TFT_RD, HIGH);
		  pinMode(TFT_RD, OUTPUT);

		  GPIO.out_w1ts = set_mask(255); // Set data bus to 0xFF

		  // Set TFT data bus lines to output
		  busDir(dir_mask, OUTPUT);

		#endif

	_init_width = _width = w; // Set by specific xxxxx_Defines.h file or by users sketch
	_init_height = _height = h; // Set by specific xxxxx_Defines.h file or by users sketch
	rotation = 0;
//		  cursor_y  = cursor_x  = 0;
//		  cursor = new c_Cursor();

//		  textfont  = 1;
//		  textsize  = 1;
//		  textcolor   = bitmap_fg = 0xFFFF; // White
//		  textbgcolor = bitmap_bg = 0x0000; // Black

	_swapBytes = false;   // Do not swap color bytes by default

	locked = true;        // ESP32 transaction mutex lock flags
	inTransaction = false;

	_booted = true;

	addr_row = 0xFFFF;
	addr_col = 0xFFFF;

//		  _xpivot = 0;
//		  _ypivot = 0;

	cspinmask = 0;
	dcpinmask = 0;
	wrpinmask = 0;
	sclkpinmask = 0;

}

Screen::~Screen() {

}
/***************************************************************************************
 ** Function name:           begin
 ** Description:             Included for backwards compatibility
 ***************************************************************************************/
void Screen::begin(uint8_t tc) {
	init(tc);
}

/***************************************************************************************
 ** Function name:           init (tc is tab color for ST7735 displays only)
 ** Description:             Reset, then initialise the TFT display registers
 ***************************************************************************************/
void Screen::init(uint8_t tc) {
	if (_booted) {
#if !defined (ESP32)
		  #if defined (TFT_CS) && (TFT_CS >= 0)
			cspinmask = (uint32_t) digitalPinToBitMask(TFT_CS);
		  #endif

		  #if defined (TFT_DC) && (TFT_DC >= 0)
			dcpinmask = (uint32_t) digitalPinToBitMask(TFT_DC);
		  #endif

		  #if defined (TFT_WR) && (TFT_WR >= 0)
			wrpinmask = (uint32_t) digitalPinToBitMask(TFT_WR);
		  #endif

		  #if defined (TFT_SCLK) && (TFT_SCLK >= 0)
			sclkpinmask = (uint32_t) digitalPinToBitMask(TFT_SCLK);
		  #endif

		  #ifdef TFT_SPI_OVERLAP
			// Overlap mode SD0=MISO, SD1=MOSI, CLK=SCLK must use D3 as CS
			//    pins(int8_t sck, int8_t miso, int8_t mosi, int8_t ss);
			//spi.pins(        6,          7,           8,          0);
			spi.pins(6, 7, 8, 0);
		  #endif

