Lagunaxx/ESP32_SPIDisplay/ESP32-SPIDisplay.cpp
		  spi.begin(); // This will set HMISO to input

		#else
#if !defined(ESP32_PARALLEL)
#if defined (TFT_MOSI) && !defined (TFT_SPI_OVERLAP)
		spi.begin(TFT_SCLK, TFT_MISO, TFT_MOSI, -1);
#else
			  spi.begin();
			#endif
#endif
#endif

		inTransaction = false;
		locked = true;

		// SUPPORT_TRANSACTIONS is mandatory for ESP32 so the hal mutex is toggled
		// so the code here is for ESP8266 only
#if !defined (SUPPORT_TRANSACTIONS) && defined (ESP8266)
			spi.setBitOrder(MSBFIRST);
			spi.setDataMode(TFT_SPI_MODE);
			spi.setFrequency(SPI_FREQUENCY);
		#endif

#if defined(ESP32_PARALLEL)
			digitalWrite(TFT_CS, LOW); // Chip select low permanently
			pinMode(TFT_CS, OUTPUT);
		#else
#ifdef TFT_CS
		// Set to output once again in case D6 (MISO) is used for CS
		digitalWrite(TFT_CS, HIGH); // Chip select high (inactive)
		pinMode(TFT_CS, OUTPUT);
#else
			spi.setHwCs(1); // Use hardware SS toggling
		  #endif
#endif

		// Set to output once again in case D6 (MISO) is used for DC
#ifdef TFT_DC
		digitalWrite(TFT_DC, HIGH); // Data/Command high = data mode
		pinMode(TFT_DC, OUTPUT);
#endif

		_booted = false;
		spi_end();
	} // end of: if just _booted

	// Toggle RST low to reset
	spi_begin();

#ifdef TFT_RST
	if (TFT_RST >= 0) {
		digitalWrite(TFT_RST, HIGH);
		delay(5);
		digitalWrite(TFT_RST, LOW);
		delay(20);
		digitalWrite(TFT_RST, HIGH);
	} else
		writecommand(TFT_SWRST); // Software reset
#else
		  writecommand(TFT_SWRST); // Software reset
		#endif

	spi_end();

	delay(150); // Wait for reset to complete

	spi_begin();

	// This loads the driver specific initialisation code  <<<<<<<<<<<<<<<<<<<<< ADD NEW DRIVERS TO THE LIST HERE <<<<<<<<<<<<<<<<<<<<<<<
#if   defined (ILI9341_DRIVER)
			#include "TFT_Drivers/ILI9341_Init.h"

		#elif defined (ST7735_DRIVER)
			tabcolor = tc;
			#include "TFT_Drivers/ST7735_Init.h"

		#elif defined (ILI9163_DRIVER)
			#include "TFT_Drivers/ILI9163_Init.h"

		#elif defined (S6D02A1_DRIVER)
			#include "TFT_Drivers/S6D02A1_Init.h"

		#elif defined (RPI_ILI9486_DRIVER)
			#include "TFT_Drivers/ILI9486_Init.h"

		#elif defined (ILI9486_DRIVER)
			#include "TFT_Drivers/ILI9486_Init.h"

		#elif defined (ILI9481_DRIVER)
			#include "TFT_Drivers/ILI9481_Init.h"

		#elif defined (ILI9488_DRIVER)
			#include "TFT_Drivers/ILI9488_Init.h"

		#elif defined (HX8357D_DRIVER)
			#include "TFT_Drivers/HX8357D_Init.h"

		#elif defined (ST7789_DRIVER)
#include "TFT_Drivers/ST7789_Init.h"

#elif defined (R61581_DRIVER)
			#include "TFT_Drivers/R61581_Init.h"

		#elif defined (RM68140_DRIVER)
			#include "TFT_Drivers/RM68140_Init.h"

		#elif defined (ST7789_2_DRIVER)
			#include "TFT_Drivers/ST7789_2_Init.h"

		#endif

#ifdef TFT_INVERSION_ON
	writecommand(TFT_INVON);
#endif

#ifdef TFT_INVERSION_OFF
		  writecommand(TFT_INVOFF);
		#endif

	spi_end();

	setRotation(rotation);

#if defined (TFT_BL) && defined (TFT_BACKLIGHT_ON)
	digitalWrite(TFT_BL, TFT_BACKLIGHT_ON);
	pinMode(TFT_BL, OUTPUT);
#else
		  #if defined (TFT_BL) && defined (M5STACK)
			// Turn on the back-light LED
			digitalWrite(TFT_BL, HIGH);
			pinMode(TFT_BL, OUTPUT);
		  #endif
		#endif
}

/***************************************************************************************
 ** Function name:           setRotation
 ** Description:             rotate the screen orientation m = 0-3 or 4-7 for BMP drawing
 ***************************************************************************************/
void Screen::setRotation(uint8_t m) {

	if (SPIStartWrite()) {

		// This loads the driver specific rotation code  <<<<<<<<<<<<<<<<<<<<< ADD NEW DRIVERS TO THE LIST HERE <<<<<<<<<<<<<<<<<<<<<<<
#if   defined (ILI9341_DRIVER)
			#include "TFT_Drivers/ILI9341_Rotation.h"

		#elif defined (ST7735_DRIVER)
			#include "TFT_Drivers/ST7735_Rotation.h"

		#elif defined (ILI9163_DRIVER)
			#include "TFT_Drivers/ILI9163_Rotation.h"

		#elif defined (S6D02A1_DRIVER)
			#include "TFT_Drivers/S6D02A1_Rotation.h"

		#elif defined (RPI_ILI9486_DRIVER)
			#include "TFT_Drivers/ILI9486_Rotation.h"

		#elif defined (ILI9486_DRIVER)
			#include "TFT_Drivers/ILI9486_Rotation.h"

		#elif defined (ILI9481_DRIVER)
			#include "TFT_Drivers/ILI9481_Rotation.h"

		#elif defined (ILI9488_DRIVER)
			#include "TFT_Drivers/ILI9488_Rotation.h"

		#elif defined (HX8357D_DRIVER)
			#include "TFT_Drivers/HX8357D_Rotation.h"

		#elif defined (ST7789_DRIVER)
#include "TFT_Drivers/ST7789_Rotation.h"

#elif defined (R61581_DRIVER)
			#include "TFT_Drivers/R61581_Rotation.h"

		#elif defined (RM68140_DRIVER)
			#include "TFT_Drivers/RM68140_Rotation.h"

		#elif defined (ST7789_2_DRIVER)
			#include "TFT_Drivers/ST7789_2_Rotation.h"

		#endif

		delayMicroseconds(10);

		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}

	addr_row = 0xFFFF;
	addr_col = 0xFFFF;
}

/***************************************************************************************
 ** Function name:           commandList, used for FLASH based lists only (e.g. ST7735)
 ** Description:             Get initialisation commands from FLASH and send to TFT
 ***************************************************************************************/
void Screen::commandList(const uint8_t *addr) {
	uint8_t numCommands;
	uint8_t numArgs;
	uint8_t ms;

	numCommands = pgm_read_byte(addr++);   // Number of commands to follow

	while (numCommands--)                  // For each command...
	{
		writecommand(pgm_read_byte(addr++)); // Read, issue command
		numArgs = pgm_read_byte(addr++);     // Number of args to follow
		ms = numArgs & TFT_INIT_DELAY;       // If hibit set, delay follows args
		numArgs &= ~TFT_INIT_DELAY;          // Mask out delay bit

		while (numArgs--)                    // For each argument...
		{
			writedata(pgm_read_byte(addr++));  // Read, issue argument
		}

		if (ms) {
			ms = pgm_read_byte(addr++);     // Read post-command delay time (ms)
			delay((ms == 255 ? 500 : ms));
		}
	}

}

/***************************************************************************************
 ** Function name:           spiwrite
 ** Description:             Write 8 bits to SPI port (legacy support only)
 ***************************************************************************************/
void Screen::spiwrite(uint8_t c) {
	tft_Write_8(c);
}

/***************************************************************************************
 ** Function name:           writecommand
 ** Description:             Send an 8 bit command to the TFT
 ***************************************************************************************/
void Screen::writecommand(uint8_t c) {
	if (SPIStartWrite()) {
		DC_C;
		tft_Write_8(c); DC_D;
		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}

