Lagunaxx/ESP32_SPIDisplay/ESP32-SPIDisplay.cpp
}

/***************************************************************************************
 ** Function name:           writedata
 ** Description:             Send a 8 bit data value to the TFT
 ***************************************************************************************/
void Screen::writedata(uint8_t d) {
	if (SPIStartWrite()) {
		DC_D;     // Play safe, but should already be in data mode
		tft_Write_8(d); CS_L;        // Allow more hold time for low VDI rail
		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}

}

/***************************************************************************************
 ** Function name:           readcommand8
 ** Description:             Read a 8 bit data value from an indexed command register
 ***************************************************************************************/
uint8_t Screen::readcommand8(uint8_t cmd_function, uint8_t index) {
	uint8_t reg = 0;
#ifdef ESP32_PARALLEL

		  writecommand(cmd_function); // Sets DC and CS high

		  busDir(dir_mask, INPUT);

		  CS_L;

		  // Read nth parameter (assumes caller discards 1st parameter or points index to 2nd)
		  while(index--) reg = readByte();

		  busDir(dir_mask, OUTPUT);

		  CS_H;

		#else
	// for ILI9341 Interface II i.e. IM [3:0] = "1101"
	if (SPIStartRead()) {

		//spi_begin_read();
		index = 0x10 + (index & 0x0F);

		DC_C;
		tft_Write_8(0xD9);DC_D;
		tft_Write_8(index);

		CS_H; // Some displays seem to need CS to be pulsed here, or is just a delay needed?
		CS_L;

		DC_C;
		tft_Write_8(cmd_function);DC_D;
		reg = tft_Read_8();

		SPIEndRead();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}
	//spi_end_read();
#endif
	return reg;
}

/***************************************************************************************
 ** Function name:           readcommand16
 ** Description:             Read a 16 bit data value from an indexed command register
 ***************************************************************************************/
uint16_t Screen::readcommand16(uint8_t cmd_function, uint8_t index) {
	uint32_t reg;

	reg = (readcommand8(cmd_function, index + 0) << 8);
	reg |= (readcommand8(cmd_function, index + 1) << 0);

	return reg;
}

/***************************************************************************************
 ** Function name:           readcommand32
 ** Description:             Read a 32 bit data value from an indexed command register
 ***************************************************************************************/
uint32_t Screen::readcommand32(uint8_t cmd_function, uint8_t index) {
	uint32_t reg;

	reg = (readcommand8(cmd_function, index + 0) << 24);
	reg |= (readcommand8(cmd_function, index + 1) << 16);
	reg |= (readcommand8(cmd_function, index + 2) << 8);
	reg |= (readcommand8(cmd_function, index + 3) << 0);

	return reg;
}

/***************************************************************************************
 ** Function name:           read pixel (for SPI Interface II i.e. IM [3:0] = "1101")
 ** Description:             Read 565 pixel colors from a pixel
 ***************************************************************************************/
uint32_t Screen::readPixel(T_DispCoords x0, T_DispCoords y0) {
#if defined(ESP32_PARALLEL)

		  readAddrWindow(x0, y0, 1, 1); // Sets CS low

		  // Set masked pins D0- D7 to input
		  busDir(dir_mask, INPUT);

		  // Dummy read to throw away don't care value
		  readByte();

		  // Fetch the 16 bit BRG pixel
		  //uint16_t rgb = (readByte() << 8) | readByte();

		  #if defined (ILI9341_DRIVER) | defined (ILI9488_DRIVER) // Read 3 bytes

		  // Read window pixel 24 bit RGB values and fill in LS bits
		  uint16_t rgb = ((readByte() & 0xF8) << 8) | ((readByte() & 0xFC) << 3) | (readByte() >> 3);

		  CS_H;

		  // Set masked pins D0- D7 to output
		  busDir(dir_mask, OUTPUT);

		  return rgb;

		  #else // ILI9481 16 bit read

		  // Fetch the 16 bit BRG pixel
		  uint16_t bgr = (readByte() << 8) | readByte();

		  CS_H;

		  // Set masked pins D0- D7 to output
		  busDir(dir_mask, OUTPUT);

		  // Swap Red and Blue (could check MADCTL setting to see if this is needed)
		  return  (bgr>>11) | (bgr<<11) | (bgr & 0x7E0);
		  #endif

		#else // Not ESP32_PARALLEL

	//spi_begin_read();
	if (SPIStartRead()) {

		readAddrWindow(x0, y0, 1, 1); // Sets CS low

#ifdef TFT_SDA_READ
			begin_SDA_Read();
		  #endif

		// Dummy read to throw away don't care value
		tft_Read_8();

		//#if !defined (ILI9488_DRIVER)

		// Read the 3 RGB bytes, color is actually only in the top 6 bits of each byte
		// as the TFT stores colors as 18 bits
		uint8_t r = tft_Read_8();
		uint8_t g = tft_Read_8();
		uint8_t b = tft_Read_8();
		/*
		 #else

		 // The 6 color bits are in MS 6 bits of each byte, but the ILI9488 needs an extra clock pulse
		 // so bits appear shifted right 1 bit, so mask the middle 6 bits then shift 1 place left
		 uint8_t r = (tft_Read_8()&0x7E)<<1;
		 uint8_t g = (tft_Read_8()&0x7E)<<1;
		 uint8_t b = (tft_Read_8()&0x7E)<<1;

		 #endif
		 */
		CS_H;

#ifdef TFT_SDA_READ
			end_SDA_Read();
		  #endif

		SPIEndRead();
		return (((uint32_t) 0) | (r << 16) | (g << 8) | b); //retuns 0x00rrggbb

	} else {
		PrintError("[]Error: SPI is buisy!");
	}
	return -1;

#endif
}

#ifdef ESP32_PARALLEL
		/***************************************************************************************
		** Function name:           read byte  - supports class functions
		** Description:             Read a byte from ESP32 8 bit data port
		***************************************************************************************/
		// Bus MUST be set to input before calling this function!
		uint8_t Screen::readByte(void)
		{
		  uint8_t b = 0;

		  RD_L;
		  uint32_t reg;           // Read all GPIO pins 0-31
		  reg = gpio_input_get(); // Read three times to allow for bus access time
		  reg = gpio_input_get();
		  reg = gpio_input_get(); // Data should be stable now
		  RD_H;

		  // Check GPIO bits used and build value
		  b  = (((reg>>TFT_D0)&1) << 0);
		  b |= (((reg>>TFT_D1)&1) << 1);
		  b |= (((reg>>TFT_D2)&1) << 2);
		  b |= (((reg>>TFT_D3)&1) << 3);
		  b |= (((reg>>TFT_D4)&1) << 4);
		  b |= (((reg>>TFT_D5)&1) << 5);
		  b |= (((reg>>TFT_D6)&1) << 6);
		  b |= (((reg>>TFT_D7)&1) << 7);

		  return b;
		}
		#endif

/***************************************************************************************
 ** Function name:           masked GPIO direction control  - supports class functions
 ** Description:             Set masked ESP32 GPIO pins to input or output
 ***************************************************************************************/
#ifdef ESP32_PARALLEL
		void Screen::busDir(uint32_t mask, uint8_t mode)
		{
		#ifdef ESP32_PARALLEL

