Lagunaxx/ESP32_SPIDisplay/ESP32-SPIDisplay.cpp
		  // Supports GPIO 0 - 31 on ESP32 only
		  gpio_config_t gpio;

		  gpio.pin_bit_mask = mask;
		  gpio.mode         = GPIO_MODE_INPUT;
		  gpio.pull_up_en   = GPIO_PULLUP_ENABLE;
		  gpio.pull_down_en = GPIO_PULLDOWN_DISABLE;
		  gpio.intr_type    = GPIO_INTR_DISABLE;

		  if (mode == OUTPUT) gpio.mode = GPIO_MODE_OUTPUT;

		  gpio_config(&gpio);

		#endif
		}
#endif

/***************************************************************************************
 ** Function name:           read rectangle (for SPI Interface II i.e. IM [3:0] = "1101")
 ** Description:             Read 565 pixel colors from a defined area
 ***************************************************************************************/
void Screen::readRect(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint16_t *data) {
	if ((x > _width) || (y > _height) || (w == 0) || (h == 0))
		return;

#if defined(ESP32_PARALLEL)

		  readAddrWindow(x, y, w, h); // Sets CS low

		  // Set masked pins D0- D7 to input
		  busDir(dir_mask, INPUT);

		  // Dummy read to throw away don't care value
		  readByte();

		  // Total pixel count
		  uint32_t len = w * h;

		#if defined (ILI9341_DRIVER) | defined (ILI9488_DRIVER) // Read 3 bytes
		  // Fetch the 24 bit RGB value
		  while (len--) {
			// Assemble the RGB 16 bit color
			uint16_t rgb = ((readByte() & 0xF8) << 8) | ((readByte() & 0xFC) << 3) | (readByte() >> 3);

			// Swapped byte order for compatibility with pushRect()
			*data++ = (rgb<<8) | (rgb>>8);
		  }
		#else // ILI9481 reads as 16 bits
		  // Fetch the 16 bit BRG pixels
		  while (len--) {
			// Read the BRG 16 bit color
			uint16_t bgr = (readByte() << 8) | readByte();

			// Swap Red and Blue (could check MADCTL setting to see if this is needed)
			uint16_t rgb = (bgr>>11) | (bgr<<11) | (bgr & 0x7E0);

			// Swapped byte order for compatibility with pushRect()
			*data++ = (rgb<<8) | (rgb>>8);
		  }
		#endif
		  CS_H;

		  // Set masked pins D0- D7 to output
		  busDir(dir_mask, OUTPUT);

		#else // Not ESP32_PARALLEL

	//spi_begin_read();
	if (SPIStartRead()) {

		readAddrWindow(x, y, w, h); // Sets CS low

#ifdef TFT_SDA_READ
			begin_SDA_Read();
		  #endif

		// Dummy read to throw away don't care value
		tft_Read_8();

		// Read window pixel 24 bit RGB values
		uint32_t len = w * h;
		while (len--) {

#if !defined (ILI9488_DRIVER)

			// Read the 3 RGB bytes, color is actually only in the top 6 bits of each byte
			// as the TFT stores colors as 18 bits
			uint8_t r = tft_Read_8();
			uint8_t g = tft_Read_8();
			uint8_t b = tft_Read_8();

#else

			// The 6 color bits are in LS 6 bits of each byte but we do not include the extra clock pulse
			// so we use a trick and mask the middle 6 bits of the byte, then only shift 1 place left
			uint8_t r = (tft_Read_8()&0x7E)<<1;
			uint8_t g = (tft_Read_8()&0x7E)<<1;
			uint8_t b = (tft_Read_8()&0x7E)<<1;

		  #endif

			// Swapped color byte order for compatibility with pushRect()
			*data++ = (r & 0xF8) | (g & 0xE0) >> 5 | (b & 0xF8) << 5
					| (g & 0x1C) << 11;
		}

		CS_H;

#ifdef TFT_SDA_READ
			end_SDA_Read();
		  #endif

		SPIEndRead();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}
	//spi_end_read();

#endif
}

/***************************************************************************************
 ** Function name:           tft_Read_8
 ** Description:             Software SPI to read bidirectional SDA line
 ***************************************************************************************/
#if defined (ESP8266) && defined (TFT_SDA_READ)
		uint8_t Screen::tft_Read_8(void)
		{
		  uint8_t  ret = 0;
		  uint32_t reg = 0;

		  for (uint8_t i = 0; i < 8; i++) {  // read results
			ret <<= 1;
			SCLK_L;
			if (digitalRead(TFT_MOSI)) ret |= 1;
			SCLK_H;
		  }

		  return ret;
		}
		#endif

/***************************************************************************************
 ** Function name:           beginSDA
 ** Description:             Detach SPI from pin to permit software SPI
 ***************************************************************************************/
#ifdef TFT_SDA_READ
		void Screen::begin_SDA_Read(void)
		{
		  #ifdef ESP32
			pinMatrixOutDetach(TFT_MOSI, false, false);
			pinMode(TFT_MOSI, INPUT);
			pinMatrixInAttach(TFT_MOSI, VSPIQ_IN_IDX, false);
		  #else // ESP8266
			#ifdef TFT_SPI_OVERLAP
			  // Reads in overlap mode not supported
			#else
			  spi.end();
			#endif
		  #endif
		}
		#endif

/***************************************************************************************
 ** Function name:           endSDA
 ** Description:             Attach SPI pins after software SPI
 ***************************************************************************************/
#ifdef TFT_SDA_READ
		void Screen::end_SDA_Read(void)
		{
		  #ifdef ESP32
			pinMode(TFT_MOSI, OUTPUT);
			pinMatrixOutAttach(TFT_MOSI, VSPID_OUT_IDX, false, false);
			pinMode(TFT_MISO, INPUT);
			pinMatrixInAttach(TFT_MISO, VSPIQ_IN_IDX, false);
		  #else
			#ifdef TFT_SPI_OVERLAP
			  spi.pins(6, 7, 8, 0);
			#else
			  spi.begin();
			#endif
		  #endif
		}
		#endif

/***************************************************************************************
 ** Function name:           push rectangle (for SPI Interface II i.e. IM [3:0] = "1101")
 ** Description:             push 565 pixel colors into a defined area
 ***************************************************************************************/
void Screen::pushRect(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint16_t *data) {
	// Function deprecated, remains for backwards compatibility
	// pushImage() is better as it will crop partly off-screen image blocks
	pushImage(x, y, w, h, data);
}

/***************************************************************************************
 ** Function name:           pushImage
 ** Description:             plot 16 bit color sprite or image onto TFT
 ***************************************************************************************/
void Screen::pushImage(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint16_t *data) {

