Lagunaxx/ESP32_SPIDisplay/ESP32-SPIDisplay.cpp
	if ((x >= _width) || (y >= _height))
		return;

	int32_t dx = 0;
	int32_t dy = 0;
	int32_t dw = w;
	int32_t dh = h;

	if (x < 0) {
		dw += x;
		dx = -x;
		x = 0;
	}
	if (y < 0) {
		dh += y;
		dy = -y;
		y = 0;
	}

	if ((x + w) > _width)
		dw = _width - x;
	if ((y + h) > _height)
		dh = _height - y;

	if (dw < 1 || dh < 1)
		return;

	if (SPIStartWrite()) {
		setWindow(x, y, x + dw - 1, y + dh - 1);

		data += dx + dy * w;

		while (dh--) {
			pushColors(data, dw, _swapBytes);
			data += w;
		}

		SPIEndWrite();
	} else {
		//calling output: Error, SPI is buisy!
		PrintError("[pushImage] Error: SPI is buisy");
	}

}

/***************************************************************************************
 ** Function name:           pushImage
 ** Description:             plot 16 bit sprite or image with 1 color being transparent
 ***************************************************************************************/
void Screen::pushImage(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint16_t *data, uint16_t transp) {

	if ((x >= _width) || (y >= _height))
		return;

	int32_t dx = 0;
	int32_t dy = 0;
	int32_t dw = w;
	int32_t dh = h;

	if (x < 0) {
		dw += x;
		dx = -x;
		x = 0;
	}
	if (y < 0) {
		dh += y;
		dy = -y;
		y = 0;
	}

	if ((x + w) > _width)
		dw = _width - x;
	if ((y + h) > _height)
		dh = _height - y;

	if (dw < 1 || dh < 1)
		return;

	if (SPIStartWrite()) {
		data += dx + dy * w;

		int32_t xe = x + dw - 1, ye = y + dh - 1;

		uint16_t lineBuf[dw];

		if (!_swapBytes)
			transp = transp >> 8 | transp << 8;

		while (dh--) {
			int32_t len = dw;
			uint16_t *ptr = data;
			int32_t px = x;
			boolean move = true;
			uint16_t np = 0;

			while (len--) {
				if (transp != *ptr) {
					if (move) {
						move = false;
						setWindow(px, y, xe, ye);
					}
					lineBuf[np] = *ptr;
					np++;
				} else {
					move = true;
					if (np) {
						pushColors((uint16_t*) lineBuf, np, _swapBytes);
						np = 0;
					}
				}
				px++;
				ptr++;
			}
			if (np)
				pushColors((uint16_t*) lineBuf, np, _swapBytes);

			y++;
			data += w;
		}
		SPIEndWrite();
	} else {
		PrintError("[pushImage]Error: SPI is buisy!");
	}
}

/****************************************************************************************************************************

 / ***************************************************************************************
 ** Function name:           pushImage - for FLASH (PROGMEM) stored images
 ** Description:             plot 16 bit image
 ***************************************************************************************/
void Screen::pushImage(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, const uint16_t *data) {
#ifdef ESP32
	pushImage(x, y, w, h, (uint16_t*) data);
#else
		  // Partitioned memory FLASH processor
		  if ((x >= _width) || (y >= _height)) return;

		  int32_t dx = 0;
		  int32_t dy = 0;
		  int32_t dw = w;
		  int32_t dh = h;

		  if (x < 0) { dw += x; dx = -x; x = 0; }
		  if (y < 0) { dh += y; dy = -y; y = 0; }

		  if ((x + w) > _width ) dw = _width  - x;
		  if ((y + h) > _height) dh = _height - y;

		  if (dw < 1 || dh < 1) return;

		if(SPIStartWrite()){

		  data += dx + dy * w;

		  uint16_t  buffer[64];
		  uint16_t* pix_buffer = buffer;

		  setWindow(x, y, x + dw - 1, y + dh - 1);

		  // Work out the number whole buffers to send
		  uint16_t nb = (dw * dh) / 64;

		  // Fill and send "nb" buffers to TFT
		  for (int32_t i = 0; i < nb; i++) {
			for (int32_t j = 0; j < 64; j++) {
			  pix_buffer[j] = pgm_read_word(&data[i * 64 + j]);
			}
			pushColors(pix_buffer, 64, _swapBytes);
		  }

		  // Work out number of pixels not yet sent
		  uint16_t np = (dw * dh) % 64;

		  // Send any partial buffer left over
		  if (np) {
			for (int32_t i = 0; i < np; i++)
			{
			  pix_buffer[i] = pgm_read_word(&data[nb * 64 + i]);
			}
			pushColors(pix_buffer, np, _swapBytes);
		  }
		  SPIEndWrite();
		}else{
		  PrintError("[pushImage]Error: SPI is buisy!");
		}

		#endif // if ESP32 else ESP8266 check
}

/***************************************************************************************
 ** Function name:           pushImage - for FLASH (PROGMEM) stored images
 ** Description:             plot 16 bit image with 1 color being transparent
 ***************************************************************************************/
void Screen::pushImage(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, const uint16_t *data, uint16_t transp) {
#ifdef ESP32
	pushImage(x, y, w, h, (uint16_t*) data, transp);
#else
		  // Partitioned memory FLASH processor
		  if ((x >= _width) || (y >= (int32_t)_height)) return;

		  int32_t dx = 0;
		  int32_t dy = 0;
		  int32_t dw = w;
		  int32_t dh = h;

		  if (x < 0) { dw += x; dx = -x; x = 0; }
		  if (y < 0) { dh += y; dy = -y; y = 0; }

		  if ((x + w) > _width ) dw = _width  - x;
		  if ((y + h) > _height) dh = _height - y;

		  if (dw < 1 || dh < 1) return;

		  if(SPIStartWrite()){

		  data += dx + dy * w;

		  int32_t xe = x + dw - 1, ye = y + dh - 1;

		  uint16_t  lineBuf[dw];

		if (!_swapBytes) transp = transp >> 8 | transp << 8;

		  while (dh--)
		  {
			int32_t len = dw;
			uint16_t* ptr = (uint16_t*)data;
			int32_t px = x;
			boolean move = true;

			uint16_t np = 0;

			while (len--)
			{
			  uint16_t color = pgm_read_word(ptr);
			  if (transp != color)
			  {
				if (move) { move = false; setWindow(px, y, xe, ye); }
				lineBuf[np] = color;
				np++;
			  }
			  else
			  {
				move = true;
				if (np)
				{
				   pushColors(lineBuf, np, _swapBytes);
				   np = 0;
				}
			  }
			  px++;
			  ptr++;
			}
			if (np) pushColors(lineBuf, np, _swapBytes);

			y++;
			data += w;
		  }
		  SPIEndWrite();
		}else{
		  	PrintError("[pushImage]Error: SPI is buisy!");
		}

		#endif // if ESP32 else ESP8266 check
}

/***************************************************************************************
 ** Function name:           pushImage
 ** Description:             plot 8 bit image or sprite using a line buffer
 ***************************************************************************************/
void Screen::pushImage(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint8_t *data, uint32_t bitmap_fg, uint32_t bitmap_bg,
		bool bpp8) {
	if ((x >= _width) || (y >= (int32_t) _height))
		return;

	int32_t dx = 0;
	int32_t dy = 0;
	int32_t dw = w;
	int32_t dh = h;

	if (x < 0) {
		dw += x;
		dx = -x;
		x = 0;
	}
	if (y < 0) {
		dh += y;
		dy = -y;
		y = 0;
	}

	if ((x + w) > _width)
		dw = _width - x;
	if ((y + h) > _height)
		dh = _height - y;

	if (dw < 1 || dh < 1)
		return;

	if (SPIStartWrite()) {

		setWindow(x, y, x + dw - 1, y + dh - 1); // Sets CS low and sent RAMWR

		// Line buffer makes plotting faster
		uint16_t lineBuf[dw];

		if (bpp8) {
			uint8_t blue[] = { 0, 11, 21, 31 }; // blue 2 to 5 bit color lookup table

			_lastColor = -1; // Set to illegal value

			// Used to store last shifted color
			uint8_t msbColor = 0;
			uint8_t lsbColor = 0;

