Lagunaxx/ESP32_SPIDisplay/ESP32-SPIDisplay.cpp
			data += dx + dy * w;
			while (dh--) {
				uint32_t len = dw;
				uint8_t *ptr = data;
				uint8_t *linePtr = (uint8_t*) lineBuf;

				while (len--) {
					uint32_t color = *ptr++;

					// Shifts are slow so check if color has changed first
					if (color != _lastColor) {
						//          =====Green=====     ===============Red==============
						msbColor = (color & 0x1C) >> 2 | (color & 0xC0) >> 3
								| (color & 0xE0);
						//          =====Green=====    =======Blue======
						lsbColor = (color & 0x1C) << 3 | blue[color & 0x03];
						_lastColor = color;
					}

					*linePtr++ = msbColor;
					*linePtr++ = lsbColor;
				}

				pushColors(lineBuf, dw, false);

				data += w;
			}
		} else {
			while (dh--) {
				w = (w + 7) & 0xFFF8;

				int32_t len = dw;
				uint8_t *ptr = data;
				uint8_t *linePtr = (uint8_t*) lineBuf;
				uint8_t bits = 8;
				while (len > 0) {
					if (len < 8)
						bits = len;
					uint32_t xp = dx;
					for (uint16_t i = 0; i < bits; i++) {
						uint8_t col = (ptr[(xp + dy * w) >> 3] << (xp & 0x7))
								& 0x80;
						if (col) {
							*linePtr++ = bitmap_fg >> 8;
							*linePtr++ = (uint8_t) bitmap_fg;
						} else {
							*linePtr++ = bitmap_bg >> 8;
							*linePtr++ = (uint8_t) bitmap_bg;
						}
						//if (col) drawPixel((dw-len)+xp,h-dh,bitmap_fg);
						//else     drawPixel((dw-len)+xp,h-dh,bitmap_bg);
						xp++;
					}
					ptr++;
					len -= 8;
				}

				pushColors(lineBuf, dw, false);

				dy++;
			}
		}
		SPIEndWrite();
	} else {
		PrintError("[pushImage]Error: SPI is buisy!");
	}
}

/***************************************************************************************
 ** Function name:           pushImage
 ** Description:             plot 8 or 1 bit image or sprite with a transparent color
 ***************************************************************************************/
void Screen::pushImage(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint8_t *data, uint32_t bitmap_fg, uint8_t transp,
		bool bpp8) {
	if ((x >= _width) || (y >= _height))
		return;

	int32_t dx = 0;
	int32_t dy = 0;
	int32_t dw = w;
	int32_t dh = h;

	if (x < 0) {
		dw += x;
		dx = -x;
		x = 0;
	}
	if (y < 0) {
		dh += y;
		dy = -y;
		y = 0;
	}

	if ((x + w) > _width)
		dw = _width - x;
	if ((y + h) > _height)
		dh = _height - y;

	if (dw < 1 || dh < 1)
		return;

	if (SPIStartWrite()) {

		int32_t xe = x + dw - 1, ye = y + dh - 1;

		// Line buffer makes plotting faster
		uint16_t lineBuf[dw];

		if (bpp8) {
			data += dx + dy * w;

			uint8_t blue[] = { 0, 11, 21, 31 }; // blue 2 to 5 bit color lookup table

			_lastColor = -1; // Set to illegal value

			// Used to store last shifted color
			uint8_t msbColor = 0;
			uint8_t lsbColor = 0;

			//int32_t spx = x, spy = y;

			while (dh--) {
				int32_t len = dw;
				uint8_t *ptr = data;
				uint8_t *linePtr = (uint8_t*) lineBuf;

				int32_t px = x;
				boolean move = true;
				uint16_t np = 0;

				while (len--) {
					if (transp != *ptr) {
						if (move) {
							move = false;
							setWindow(px, y, xe, ye);
						}
						uint8_t color = *ptr;

						// Shifts are slow so check if color has changed first
						if (color != _lastColor) {
							//          =====Green=====     ===============Red==============
							msbColor = (color & 0x1C) >> 2 | (color & 0xC0) >> 3
									| (color & 0xE0);
							//          =====Green=====    =======Blue======
							lsbColor = (color & 0x1C) << 3 | blue[color & 0x03];
							_lastColor = color;
						}
						*linePtr++ = msbColor;
						*linePtr++ = lsbColor;
						np++;
					} else {
						move = true;
						if (np) {
							pushColors(lineBuf, np, false);
							linePtr = (uint8_t*) lineBuf;
							np = 0;
						}
					}
					px++;
					ptr++;
				}

				if (np)
					pushColors(lineBuf, np, false);

				y++;
				data += w;
			}
		} else {
			w = (w + 7) & 0xFFF8;
			while (dh--) {
				int32_t px = x;
				boolean move = true;
				uint16_t np = 0;
				int32_t len = dw;
				uint8_t *ptr = data;
				uint8_t bits = 8;
				while (len > 0) {
					if (len < 8)
						bits = len;
					uint32_t xp = dx;
					uint32_t yp = (dy * w) >> 3;
					for (uint16_t i = 0; i < bits; i++) {
						//uint8_t col = (ptr[(xp + dy * w)>>3] << (xp & 0x7)) & 0x80;
						if ((ptr[(xp >> 3) + yp] << (xp & 0x7)) & 0x80) {
							if (move) {
								move = false;
								setWindow(px, y, xe, ye);
							}
							np++;
						} else {
							if (np) {
								pushColor(bitmap_fg, np);
								np = 0;
								move = true;
							}
						}
						px++;
						xp++;
					}
					ptr++;
					len -= 8;
				}
				if (np)
					pushColor(bitmap_fg, np);
				y++;
				dy++;
			}
		}
		SPIEndWrite();
	} else {
		PrintError("[pushImage]Error: SPI is buisy!");
	}

}

/***************************************************************************************
 ** Function name:           setSwapBytes
 ** Description:             Used by 16 bit pushImage() to swap byte order in colors
 ***************************************************************************************/
void Screen::setSwapBytes(bool swap) {
	_swapBytes = swap;
}

/***************************************************************************************
 ** Function name:           getSwapBytes
 ** Description:             Return the swap byte order for colors
 ***************************************************************************************/
bool Screen::getSwapBytes(void) {
	return _swapBytes;
}

/***************************************************************************************
 ** Function name:           read rectangle (for SPI Interface II i.e. IM [3:0] = "1101")
 ** Description:             Read RGB pixel colors from a defined area
 ***************************************************************************************/
// If w and h are 1, then 1 pixel is read, *data array size must be 3 bytes per pixel
void Screen::readRectRGB(T_DispCoords x0, T_DispCoords y0, T_DispCoords w,
		T_DispCoords h, uint8_t *data) {
#if defined(ESP32_PARALLEL)

		  // ESP32 parallel bus supported yet

		#else  // Not ESP32_PARALLEL

