Lagunaxx/ESP32_SPIDisplay/ESP32-SPIDisplay.cpp
		}

		#endif

/***************************************************************************************
 ** Function name:           drawFastVLine
 ** Description:             draw a vertical line
 ***************************************************************************************/
#if defined (ESP8266) && !defined (RPI_WRITE_STROBE)
		void Screen::drawFastVLine(T_DispCoords x, T_DispCoords y, T_DispCoords h, uint32_t color)
		{
		  // Clipping
		  if ((x < 0) || (x >= _width) || (y >= _height)) return;

		  if (y < 0) { h += y; y = 0; }

		  if ((y + h) > _height) h = _height - y;

		  if (h < 1) return;

		  if(SPIStartWrite()){

		  setWindow(x, y, x, y + h - 1);

		  writeBlock(color, h);

		  SPIEndWrite();
			}else{
				PrintError("[]Error: SPI is buisy!");
			}

		}

		#else

void Screen::drawFastVLine(T_DispCoords x, T_DispCoords y, T_DispCoords h,
		uint32_t color) {
	// Clipping
	if ((x < 0) || (x >= _width) || (y >= _height))
		return;

	if (y < 0) {
		h += y;
		y = 0;
	}

	if ((y + h) > _height)
		h = _height - y;

	if (h < 1)
		return;

	if (SPIStartWrite()) {

		setWindow(x, y, x, y + h - 1);

#ifdef RPI_WRITE_STROBE
		  #if defined (ESP8266)
			SPI1W0 = (color >> 8) | (color << 8);
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}
		  #else
			tft_Write_16(color);
		  #endif
			h--;
			while(h--) {WR_L; WR_H;}
		#else
#ifdef ESP32_PARALLEL
			while (h--) {tft_Write_16(color);}
		  #else
		writeBlock(color, h);
#endif
#endif

		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}

}
#endif

/***************************************************************************************
 ** Function name:           drawFastHLine
 ** Description:             draw a horizontal line
 ***************************************************************************************/
#if defined (ESP8266) && !defined (RPI_WRITE_STROBE)
		void Screen::drawFastHLine(T_DispCoords x, T_DispCoords y, T_DispCoords w, uint32_t color)
		{
		  // Clipping
		  if ((y < 0) || (x >= _width) || (y >= _height)) return;

		  if (x < 0) { w += x; x = 0; }

		  if ((x + w) > _width)  w = _width  - x;

		  if (w < 1) return;

		  if(SPIStartWrite()){
			  setWindow(x, y, x + w - 1, y);
			  writeBlock(color, w);
			  SPIEndWrite();
			}else{
				PrintError("[]Error: SPI is buisy!");
			}

		}

		#else

void Screen::drawFastHLine(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		uint32_t color) {
	// Clipping
	if ((y < 0) || (x >= _width) || (y >= _height))
		return;
	if (x < 0) {
		w += x;
		x = 0;
	}
	if ((x + w) > _width)
		w = _width - x;
	if (w < 1)
		return;

	if (SPIStartWrite()) {

		setWindow(x, y, x + w - 1, y);

#ifdef RPI_WRITE_STROBE
				#if defined (ESP8266)
			SPI1W0 = (color >> 8) | (color << 8);
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}
				#else
			tft_Write_16(color);
				#endif
			w--;
			while(w--) {WR_L; WR_H;}
			#else
#ifdef ESP32_PARALLEL
			while (w--) {tft_Write_16(color);}
				#else
		writeBlock(color, w);
#endif
#endif

		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}

}
#endif

/***************************************************************************************
 ** Function name:           fillRect
 ** Description:             draw a filled rectangle
 ***************************************************************************************/
#if defined (ESP8266) && !defined (RPI_WRITE_STROBE)
		void Screen::fillRect(T_DispCoords x, T_DispCoords y, T_DispCoords w, T_DispCoords h, uint32_t color)
		{
		  // Clipping
		  if ((x >= _width) || (y >= _height)) return;

		  if (x < 0) { w += x; x = 0; }
		  if (y < 0) { h += y; y = 0; }

		  if ((x + w) > _width)  w = _width  - x;
		  if ((y + h) > _height) h = _height - y;

		  if ((w < 1) || (h < 1)) return;

		  if(SPIStartWrite()){

		  setWindow(x, y, x + w - 1, y + h - 1);

		  writeBlock(color, w * h);

		  SPIEndWrite();
			}else{
				PrintError("[]Error: SPI is buisy!");
			}

		}

		#else

void Screen::fillRect(T_DispCoords x, T_DispCoords y, T_DispCoords w,
		T_DispCoords h, uint32_t color) {

	// Clipping
	if ((x >= _width) || (y >= _height))
		return;

	if (x < 0) {
		w += x;
		x = 0;
	}
	if (y < 0) {
		h += y;
		y = 0;
	}

	if ((x + w) > _width)
		w = _width - x;
	if ((y + h) > _height)
		h = _height - y;

	if ((w < 1) || (h < 1))
		return;

	if (SPIStartWrite()) {

		setWindow(x, y, x + w - 1, y + h - 1);

		uint32_t n = (uint32_t) w * (uint32_t) h;

#ifdef RPI_WRITE_STROBE
		  tft_Write_16(color);
		  while(n--) {WR_L; WR_H;}
		#else
#ifdef ESP32_PARALLEL
			if (color>>8 == (uint8_t)color)
			{
			  tft_Write_8(color);
			  n--; WR_L; WR_H;
			  while (n) {WR_L; WR_H; n--; WR_L; WR_H;}
			}
			else
			{
			  while (n--) {tft_Write_16(color);}
			}
		  #else
		writeBlock(color, n);
#endif
#endif

		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}

}
#endif

/***************************************************************************************
 ** Function name:           invertDisplay
 ** Description:             invert the display colors i = 1 invert, i = 0 normal
 ***************************************************************************************/
void Screen::invertDisplay(boolean i) {
	if (SPIStartWrite()) {
		// Send the command twice as otherwise it does not always work!
		writecommand(i ? TFT_INVON : TFT_INVOFF);
		writecommand(i ? TFT_INVON : TFT_INVOFF);
		SPIEndWrite();
	} else {
		PrintError("[]Error: SPI is buisy!");
	}

}

/***************************************************************************************
 ** Function name:           writeBlock
 ** Description:             Write a block of pixels of the same color
 ***************************************************************************************/
//Clear screen test 76.8ms theoretical. 81.5ms Screen, 967ms Adafruit_ILI9341
//Performance 26.15Mbps@26.66MHz, 39.04Mbps@40MHz, 75.4Mbps@80MHz SPI clock
//Efficiency:
//       Screen       98.06%              97.59%          94.24%
//       Adafruit_GFX   19.62%              14.31%           7.94%
//
#if defined (ESP8266) && !defined (ILI9488_DRIVER)
		void Screen::writeBlock(uint16_t color, uint32_t repeat)
		{
		  uint16_t color16 = (color >> 8) | (color << 8);
		  uint32_t color32 = color16 | color16 << 16;

		  SPI1W0 = color32;
		  SPI1W1 = color32;
		  SPI1W2 = color32;
		  SPI1W3 = color32;
		  if (repeat > 8)
		  {
			SPI1W4 = color32;
			SPI1W5 = color32;
			SPI1W6 = color32;
			SPI1W7 = color32;
		  }
		  if (repeat > 16)
		  {
			SPI1W8 = color32;
			SPI1W9 = color32;
			SPI1W10 = color32;
			SPI1W11 = color32;
		  }
		  if (repeat > 24)
		  {
			SPI1W12 = color32;
			SPI1W13 = color32;
			SPI1W14 = color32;
			SPI1W15 = color32;
		  }
		  if (repeat > 31)
		  {
			SPI1U1 = (511 << SPILMOSI);
			while(repeat>31)
			{
		#if defined SPI_FREQUENCY && (SPI_FREQUENCY == 80000000)
			  if(SPI1CMD & SPIBUSY) // added to sync with flag change
		#endif
			  while(SPI1CMD & SPIBUSY) {}
			  SPI1CMD |= SPIBUSY;
			  repeat -= 32;
			}
			while(SPI1CMD & SPIBUSY) {}
		  }

		  if (repeat)
		  {
			repeat = (repeat << 4) - 1;
			SPI1U1 = (repeat << SPILMOSI);
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}
		  }

