Lagunaxx/ESP32_SPIDisplay/ESP32-SPIDisplay.cpp
		}

		#elif defined (ILI9488_DRIVER)

		#ifdef ESP8266
		void writeBlock(uint16_t color, uint32_t repeat)
		{

		  // Split out the colors
		  uint8_t r = (color & 0xF800)>>8;
		  uint8_t g = (color & 0x07E0)>>3;
		  uint8_t b = (color & 0x001F)<<3;
		  // Concatenate 4 pixels into three 32 bit blocks
		  uint32_t r0 = r<<24 | b<<16 | g<<8 | r;
		  uint32_t r1 = g<<24 | r<<16 | b<<8 | g;
		  uint32_t r2 = b<<24 | g<<16 | r<<8 | b;

		  SPI1W0 = r0;
		  SPI1W1 = r1;
		  SPI1W2 = r2;

		  if (repeat > 4)
		  {
			SPI1W3 = r0;
			SPI1W4 = r1;
			SPI1W5 = r2;
		  }
		  if (repeat > 8)
		  {
			SPI1W6 = r0;
			SPI1W7 = r1;
			SPI1W8 = r2;
		  }
		  if (repeat > 12)
		  {
			SPI1W9  = r0;
			SPI1W10 = r1;
			SPI1W11 = r2;
			SPI1W12 = r0;
			SPI1W13 = r1;
			SPI1W14 = r2;
			SPI1W15 = r0;
		  }

		  if (repeat > 20)
		  {
			SPI1U1 = (503 << SPILMOSI);
			while(repeat>20)
			{
			  while(SPI1CMD & SPIBUSY) {}
			  SPI1CMD |= SPIBUSY;
			  repeat -= 21;
			}
			while(SPI1CMD & SPIBUSY) {}
		  }

		  if (repeat)
		  {
			repeat = (repeat * 24) - 1;
			SPI1U1 = (repeat << SPILMOSI);
			SPI1CMD |= SPIBUSY;
			while(SPI1CMD & SPIBUSY) {}
		  }

		}
		#else // Now the code for ESP32 and ILI9488

		void writeBlock(uint16_t color, uint32_t repeat)
		{
		  // Split out the colors
		  uint32_t r = (color & 0xF800)>>8;
		  uint32_t g = (color & 0x07E0)<<5;
		  uint32_t b = (color & 0x001F)<<19;
		  // Concatenate 4 pixels into three 32 bit blocks
		  uint32_t r0 = r<<24 | b | g | r;
		  uint32_t r1 = r0>>8 | g<<16;
		  uint32_t r2 = r1>>8 | b<<8;

		  if (repeat > 19)
		  {
			SET_PERI_REG_BITS(SPI_MOSI_DLEN_REG(SPI_PORT), SPI_USR_MOSI_DBITLEN, 479, SPI_USR_MOSI_DBITLEN_S);

			while(repeat>19)
			{
			  while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
			  WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), r0);
			  WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), r1);
			  WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), r2);
			  WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), r0);
			  WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), r1);
			  WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), r2);
			  WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), r0);
			  WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), r1);
			  WRITE_PERI_REG(SPI_W8_REG(SPI_PORT), r2);
			  WRITE_PERI_REG(SPI_W9_REG(SPI_PORT), r0);
			  WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), r1);
			  WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), r2);
			  WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), r0);
			  WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), r1);
			  WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), r2);
			  SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
			  repeat -= 20;
			}
			while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
		  }

		  if (repeat)
		  {
			SET_PERI_REG_BITS(SPI_MOSI_DLEN_REG(SPI_PORT), SPI_USR_MOSI_DBITLEN, (repeat * 24) - 1, SPI_USR_MOSI_DBITLEN_S);
			WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), r0);
			WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), r1);
			WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), r2);
			WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), r0);
			WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), r1);
			WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), r2);
			if (repeat > 8 )
			{
			  WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), r0);
			  WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), r1);
			  WRITE_PERI_REG(SPI_W8_REG(SPI_PORT), r2);
			  WRITE_PERI_REG(SPI_W9_REG(SPI_PORT), r0);
			  WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), r1);
			  WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), r2);
			  WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), r0);
			  WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), r1);
			  WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), r2);
			}

			SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
			while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
		  }

		}
		#endif

		#else // Low level register based ESP32 code for 16 bit color SPI TFTs

void Screen::writeBlock(uint16_t color, uint32_t repeat) {
	uint32_t color32 = COL_32(color, color);

	if (repeat > 31) // Revert legacy toggle buffer change
			{
		WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 511);
		while (repeat > 31) {
			while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
				;
			WRITE_PERI_REG(SPI_W0_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W1_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W2_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W3_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W4_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W5_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W6_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W7_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W8_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W9_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), color32);
			WRITE_PERI_REG(SPI_W15_REG(SPI_PORT), color32);
			SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
			repeat -= 32;
		}
		while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
			;
	}

	if (repeat) {
		// Revert toggle buffer change
		WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), (repeat << 4) - 1);
		for (uint32_t i = 0; i <= (repeat >> 1); i++)
			WRITE_PERI_REG((SPI_W0_REG(SPI_PORT) + (i << 2)), color32);
		SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
		while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT)) & SPI_USR)
			;
	}
}
#endif

/***************************************************************************************
 ** Function name:           getSPIinstance
 ** Description:             Get the instance of the SPI class (for ESP32 only)
 ***************************************************************************************/
#ifndef ESP32_PARALLEL
SPIClass& Screen::getSPIinstance(void) {
	return spi;
}
#endif

/***************************************************************************************
 ** Function name:           getSetup
 ** Description:             Get the setup details for diagnostic and sketch access
 ***************************************************************************************/
void Screen::getSetup(T_DisplaySettings &tft_settings) {
	// tft_settings.version is set in header file

#if defined (ESP8266)
		  tft_settings.esp = 8266;
		#elif defined (ESP32)
	tft_settings.esp = 32;
#else
		  tft_settings.esp = -1;
		#endif

#if defined (SUPPORT_TRANSACTIONS)
	tft_settings.trans = true;
#else
		  tft_settings.trans = false;
		#endif

#if defined (ESP32_PARALLEL)
		  tft_settings.serial = false;
		  tft_settings.spi_freq = 0;
		#else
	tft_settings.serial = true;
	tft_settings.spi_freq = SPI_FREQUENCY / 100000;
#ifdef SPI_READ_FREQUENCY
	tft_settings.rd_freq = SPI_READ_FREQUENCY / 100000;
#endif
#endif

