Lagunaxx/ESP32_SPIDisplay/ESP32-SPIDisplay.cpp
#if defined(TFT_SPI_OVERLAP)
		  tft_settings.overlap = true;
		#else
	tft_settings.overlap = false;
#endif

	tft_settings.driver = TFT_DRIVER;
	tft_settings.width = _init_width;
	tft_settings.height = _init_height;

#ifdef CGRAM_OFFSET
	tft_settings.r0_x_offset = colstart;
	tft_settings.r0_y_offset = rowstart;
	tft_settings.r1_x_offset = 0;
	tft_settings.r1_y_offset = 0;
	tft_settings.r2_x_offset = 0;
	tft_settings.r2_y_offset = 0;
	tft_settings.r3_x_offset = 0;
	tft_settings.r3_y_offset = 0;
#else
		  tft_settings.r0_x_offset = 0;
		  tft_settings.r0_y_offset = 0;
		  tft_settings.r1_x_offset = 0;
		  tft_settings.r1_y_offset = 0;
		  tft_settings.r2_x_offset = 0;
		  tft_settings.r2_y_offset = 0;
		  tft_settings.r3_x_offset = 0;
		  tft_settings.r3_y_offset = 0;
		#endif

#if defined (TFT_MOSI)
	tft_settings.pin_mosi = TFT_MOSI;
#else
		  tft_settings.pin_mosi = -1;
		#endif

#if defined (TFT_MISO)
	tft_settings.pin_miso = TFT_MISO;
#else
		  tft_settings.pin_miso = -1;
		#endif

#if defined (TFT_SCLK)
	tft_settings.pin_clk = TFT_SCLK;
#else
		  tft_settings.pin_clk  = -1;
		#endif

#if defined (TFT_CS)
	tft_settings.pin_cs = TFT_CS;
#else
		  tft_settings.pin_cs   = -1;
		#endif

#if defined (TFT_DC)
	tft_settings.pin_dc = TFT_DC;
#else
		  tft_settings.pin_dc  = -1;
		#endif

#if defined (TFT_RD)
		  tft_settings.pin_rd  = TFT_RD;
		#else
	tft_settings.pin_rd = -1;
#endif

#if defined (TFT_WR)
		  tft_settings.pin_wr  = TFT_WR;
		#else
	tft_settings.pin_wr = -1;
#endif

#if defined (TFT_RST)
	tft_settings.pin_rst = TFT_RST;
#else
		  tft_settings.pin_rst = -1;
		#endif

#if defined (ESP32_PARALLEL)
		  tft_settings.pin_d0 = TFT_D0;
		  tft_settings.pin_d1 = TFT_D1;
		  tft_settings.pin_d2 = TFT_D2;
		  tft_settings.pin_d3 = TFT_D3;
		  tft_settings.pin_d4 = TFT_D4;
		  tft_settings.pin_d5 = TFT_D5;
		  tft_settings.pin_d6 = TFT_D6;
		  tft_settings.pin_d7 = TFT_D7;
		#else
	tft_settings.pin_d0 = -1;
	tft_settings.pin_d1 = -1;
	tft_settings.pin_d2 = -1;
	tft_settings.pin_d3 = -1;
	tft_settings.pin_d4 = -1;
	tft_settings.pin_d5 = -1;
	tft_settings.pin_d6 = -1;
	tft_settings.pin_d7 = -1;
#endif

#if defined (TOUCH_CS)
		  tft_settings.pin_tch_cs   = TOUCH_CS;
		  tft_settings.tch_spi_freq = SPI_TOUCH_FREQUENCY/100000;
		#else
	tft_settings.pin_tch_cs = -1;
	tft_settings.tch_spi_freq = 0;
#endif
}

////////////////////////////////////////////////////////////////////////////////////////

/*
 c_Cursor* Screen::Cursor(){
 return cursor; //returns cursor
 }
 void Screen::Cursor(c_Cursor& _cursor){
 ;
 }
 */

}
}
